In [5]:
!pip install pymssql

Collecting pymssql
  Downloading https://files.pythonhosted.org/packages/fe/aa/59c7c8a2cf1ef0726cd4c64bff7072147db8cbb6b4379fb0c3d7c67331b9/pymssql-2.1.5-cp36-cp36m-manylinux1_x86_64.whl (1.3MB)
     |████████████████████████████████| 1.3MB 2.8MB/s
Installing collected packages: pymssql
Successfully installed pymssql-2.1.5

In [6]:
import pymssql

pymssql.VERSION

(2, 1, 5)

In [8]:
## MSSQL
conn = pymssql.connect(host='210.115.229.77:2433', user='20195124', password='s195124@hallym', database='20195124')

## Connection으로 부터 Cursor 생성
## cursor 는 ssms에서 쿼리문을 작성하는 페이지 같은 것
## 쿼리문을 작성할 수 있게 해주는 도구
cursor = conn.cursor()

In [16]:
## SQL 문 작성
query = "SELECT * FROM student WHERE name LIKE '%i%'"

## SQL 문 실행
cursor.execute(query)

In [17]:
## SQL 문 결과 모두 가져오기
rows = cursor.fetchall()
print(rows, type(rows))

[('44553', 'Peltier', 'Physics', 56), ('54321', 'Williams', 'Comp.Sci.', 54), ('76653', 'Aoi', 'Elec.Eng.', 60), ('98765', 'Bourikas', 'Elec.Eng.', 98)] <class 'list'>

In [18]:
for row in rows:
  print(row, type(row))

('44553', 'Peltier', 'Physics', 56) <class 'tuple'>
('54321', 'Williams', 'Comp.Sci.', 54) <class 'tuple'>
('76653', 'Aoi', 'Elec.Eng.', 60) <class 'tuple'>
('98765', 'Bourikas', 'Elec.Eng.', 98) <class 'tuple'>

In [19]:
## SQL 문 재실행
cursor.execute(query)

row = cursor.fetchone()
while row:
  print(row, type(row))
  row = cursor.fetchone()

print(row)

('44553', 'Peltier', 'Physics', 56) <class 'tuple'>
('54321', 'Williams', 'Comp.Sci.', 54) <class 'tuple'>
('76653', 'Aoi', 'Elec.Eng.', 60) <class 'tuple'>
('98765', 'Bourikas', 'Elec.Eng.', 98) <class 'tuple'>
None

In [20]:
## SQL 문 재실행
cursor.execute(query)

rows = cursor.fetchmany(3)

print('# 3개의 데이터 출력')

for row in rows:
  print(row, type(row))

print('# 나머지 1개의 데이터 출력')
row = cursor.fetchone()
print(row, type(row))

# 3개의 데이터 출력
('44553', 'Peltier', 'Physics', 56) <class 'tuple'>
('54321', 'Williams', 'Comp.Sci.', 54) <class 'tuple'>
('76653', 'Aoi', 'Elec.Eng.', 60) <class 'tuple'>
# 나머지 1개의 데이터 출력
('98765', 'Bourikas', 'Elec.Eng.', 98) <class 'tuple'>

In [28]:
## SQL 문 작성
query = "INSERT INTO student VALUES ('99999', 'tester', 'Comp.Sci.', 999)"

## SQL 문 실행
cursor.execute(query)
conn.commit()

In [29]:
## SQL 문 작성
query = "SELECT * FROM student"

## SQL 문 실행
cursor.execute(query)

rows = cursor.fetchall()

for row in rows:
  print(row)

('00128', 'Zhang', 'Comp.Sci.', 102)
('12345', 'Shankar', 'Comp.Sci.', 32)
('19991', 'Brandt', 'History', 80)
('23121', 'Chavez', 'Finance', 110)
('44553', 'Peltier', 'Physics', 56)
('45678', 'Levy', 'Physics', 46)
('54321', 'Williams', 'Comp.Sci.', 54)
('55739', 'Sanchez', 'Music', 38)
('70557', 'Snow', 'Physics', 0)
('76543', 'Brown', 'Comp.Sci.', 58)
('76653', 'Aoi', 'Elec.Eng.', 60)
('98765', 'Bourikas', 'Elec.Eng.', 98)
('99999', 'tester', 'Comp.Sci.', 999)

In [30]:
## SQL 문 작성
query = "DELETE student WHERE id = '99999'"

## SQL 문 실행
cursor.execute(query)

## commit 을 안했기 때문에 여기서만 삭제된 것이 보임

In [31]:
## SQL 문 작성
query = "SELECT * FROM student"

## SQL 문 실행
cursor.execute(query)

rows = cursor.fetchall()

for row in rows:
  print(row)

('00128', 'Zhang', 'Comp.Sci.', 102)
('12345', 'Shankar', 'Comp.Sci.', 32)
('19991', 'Brandt', 'History', 80)
('23121', 'Chavez', 'Finance', 110)
('44553', 'Peltier', 'Physics', 56)
('45678', 'Levy', 'Physics', 46)
('54321', 'Williams', 'Comp.Sci.', 54)
('55739', 'Sanchez', 'Music', 38)
('70557', 'Snow', 'Physics', 0)
('76543', 'Brown', 'Comp.Sci.', 58)
('76653', 'Aoi', 'Elec.Eng.', 60)
('98765', 'Bourikas', 'Elec.Eng.', 98)